var data = [{
              "Key": "RU-AMU",
              "Name": "Амурская область"
              // "<h4><span></span></h4><p><img src='img/'></p>"
            },
            {
              "Key": "RU-ARK",
              "Name": "Архангельская область",
              "Desc": [
                "<h4>Церковь Богоявления Господня в Поле<span>1851</span></h4><p><img src='img/jhgfdcgvhbjnkml.JPG'>Церковь находится на западной окраине деревни Поле на холме на южном берегу реки Кодина, правого притока Онеги. Состоит из четырёх основных срубов, рубленых «в обло» из брёвен диаметром 25—30 см, стоит на земле. Основной сруб церкви представляет собой двусветный четверик размерами 8,4×8,8 м, перекрытый кубоватой тёсовой кровлей с двумя поставленными друг на друга восьмериками в центре, поддерживающими шею и главку (последние не сохранились, восстановлены после 1990 года). Остальные три сруба — пятигранный алтарь, трапезная и притвор, над которым поставлена колокольня. Пятигранная алтарная апсида имеет длины граней 4,6; 2,0; 2,6; 2,0 и 4,6 м, поднимается до половины нижнего четверика церкви, крыта тёсом на пять скатов.</p>",
                "<h4>Лютеранская церковь Святой Екатерины<span>1768</span></h4><p><img src='img/800px-Archangelskaja_Kircha.jpg'>Начиная с середины XVII века в Архангельске постоянно проживало большое количество иностранных купцов, в том числе немцев и голландцев. Первоначально в городе был создан реформатский приход (именовавший голландским), а к 1683 году и лютеранский (именовавшийся гамбургским). Оба имели отдельные здания, сделанные из дерева. В 1768 году лютеране построили новое каменное здание, которое существует и по настоящее время. После нескольких перестроений изначально барочное здание приобрело более готический облик.</p>",
              ]
            },
            {
              "Key": "RU-AST",
              "Name": "Астраханская область"
            },
            {
              "Key": "RU-BEL",
              "Name": "Белгородская область"
            },
            {
              "Key": "RU-BRY",
              "Name": "Брянская область"
            },
            {
              "Key": "RU-VLA",
              "Name": "Владимирская область"
            },
            {
              "Key": "RU-VGG",
              "Name": "Волгоградская область"
            },
            {
              "Key": "RU-VLG",
              "Name": "Вологодская область"
            },
            {
              "Key": "RU-VOR",
              "Name": "Воронежская область"
            },
            {
              "Key": "RU-IVA",
              "Name": "Ивановская область"
            },
            {
              "Key": "RU-IRK",
              "Name": "Иркутская область",
              "Desc": [
                "<h4>Собор Богоявления<span>1718</span></h4><p><img src='img/Church_of_the_Epiphany_(Irkutsk).jpg'>Собор Богоявления был основан в 1693 году за восточной стеной Иркутского кремля. Первоначально храм был деревянным и носил название Петропавловская церковь. Её имя носила одна из башен кремля. Все постройки этого храма сгорели во время пожара 1716 года.Спустя два года было решено восстановить собор, но уже из кирпича. Пожертвования на его строительство делали горожане и гости Иркутска. Через шесть лет после закладки первого камня был построен Петропавловский придел во имя святых апостолов Петра и Павла.</p>",
                "<h4>Троицкая церковь<span>1778</span></h4><p><img src='img/800px-Trinity_Church_in_Irkutsk.jpg'>Один из старейших православных храмов Иркутска. Точная дата начала строительства каменной церкви не установлена. Вероятно, она была заложена в период с 1754 по 1759 годы. 5 мая 1763 года был освящён правый придел, 26 июля 1775 года — левый придел. 22 сентября 1778 года церковь была освящена. В 1802 году во дворе Троицкой церкви по проекту архитектора Антона Лосева была заложена церковь Святого Григория Неокесарийского. В 1949 году в здании Троицкой церкви был устроен планетарий.Наряду с Крестовоздвиженской церковью Троицкая церковь является ярким образцом «сибирского барокко» в Иркутске.</p>"
              ]
            },
            {
              "Key": "RU-KGD",
              "Name": "Калининградская область"
            },
            {
              "Key": "RU-KLU",
              "Name": "Калужская область"
            },
            {
              "Key": "RU-KEM",
              "Name": "Кемеровская область"
            },
            {
              "Key": "RU-KIR",
              "Name": "Кировская область"
            },
            {
              "Key": "RU-KOS",
              "Name": "Костромская область"
            },
            {
              "Key": "RU-KGN",
              "Name": "Курганская область"
            },
            {
              "Key": "RU-KRS",
              "Name": "Курская область"
            },
            {
              "Key": "RU-LEN",
              "Name": "Ленинградская область"
            },
            {
              "Key": "RU-LIP",
              "Name": "Липецкая область"
            },
            {
              "Key": "RU-MAG",
              "Name": "Магаданская область"
            },
            {
              "Key": "RU-MOS",
              "Name": "Московская область"
            },
            {
              "Key": "RU-MUR",
              "Name": "Мурманская область"
            },
            {
              "Key": "RU-NIZ",
              "Name": "Нижегородская область"
            },
            {
              "Key": "RU-NGR",
              "Name": "Новгородская область"
            },
            {
              "Key": "RU-NVS",
              "Name": "Новосибирская область"
            },
            {
              "Key": "RU-OMS",
              "Name": "Омская область"
            },
            {
              "Key": "RU-ORE",
              "Name": "Оренбургская область"
            },
            {
              "Key": "RU-ORL",
              "Name": "Орловская область"
            },
            {
              "Key": "RU-PNZ",
              "Name": "Пензенская область"
            },
            {
              "Key": "RU-PSK",
              "Name": "Псковская область"
            },
            {
              "Key": "RU-ROS",
              "Name": "Ростовская область"
            },
            {
              "Key": "RU-RYA",
              "Name": "Рязанская область"
            },
            {
              "Key": "RU-SAM",
              "Name": "Самарская область",
              "Desc": [
                "<h4>Кафедральный собор в честь Покрова Божией Матери<span>1861</span></h4><p><img src='img/Ascension_Church_(Samara)_09.JPG'>В XVIII веке деревянная Вознесенская церковь стояла на перекрёстке современных улиц Водников и Комсомольской. Но после пожаров середины XVIII и начала XIX веков для возведения каменного Вознесенского храма было определено новое место. Проект в классическом стиле составили в 1838 году в Симбирске и позже доработали в Санкт-Петербурге. Главный, Вознесенский, придел был освящён в 1848 году, а в 1851 году храм получил статус кафедрального собора. 21 января 1930 года собор был закрыт под выставку восковых фигур клуба кустарей, а позднее передан под склад. И только 15 августа 1993 года в восстановленном храме снова начали проводиться богослужения.</br>Адрес: ул. Степана Разина, 78</p>",
                "<h4>Храм во имя апостолов Петра и Павла<span>1865</span></h4><p><img src='img/800px-Petr_v.jpg'>Церковь была построена на средства купца Андрея Головачёва и освящена 26 сентября 1865 года. Архитектура храма выдержана в русском стиле. В 1898-99 годах в два раза были увеличены объёмы боковых приделов. В 1939 году церковь закрыли под военный склад, однако в конце Великой Отечественной войны вновь возвратили верующим, отремонтировали и восстановили роспись.</br>Адрес: ул. Буянова, 135А</p>",
                "<h4>Иверский женский монастырь<span>1860</span></h4><p><img src='img/1024px-Iversk_monast_Samara.JPG'>Открытие в Самаре женской общины состоялось в январе 1850 года по инициативе граждан. Обитель названа в честь иконы Божией Матери «Иверской», которую пожертвовала купчиха Екатерина Марихина. 21 августа 1860 года Иверская женская община стала монастырём. К 1917 году в нём стояло четыре каменных храма: во имя Успения Божией Матери, во имя Иверской иконы Божией Матери, во имя святого Чудотворца Николая и трапезный храм во имя «Иерусалимской» иконы Божией Матери.В 1896 году на территории монастыря похоронен П. В. Алабин. В 1919 году монастырь был закрыт, а на его бывших владениях создана швейная артель. Храмы перешли в распоряжение вновь зарегистрированной общины верующих. В начале 30-х годов был взорван Успенский собор и разрушена 65-метровая колокольня. Второе рождение женского монастыря началось в 1991 году, когда образовалась новая женская община Иверская, получившая в 1994 году статус монастыря. Храмы возвращены обители, восстановлена ограда и колокольня, восстанавливаются утраченные церкви. На территории монастыря установлен и освящён поклонный крест, выполненный скульптором Вячеславом Клыковым.</br>Адрес: Волжский проспект, 1</p>"
              ]
            },
            {
              "Key": "RU-SAR",
              "Name": "Саратовская область"
            },
            {
              "Key": "RU-SAK",
              "Name": "Сахалинская область"
            },
            {
              "Key": "RU-SVE",
              "Name": "Свердловская область"
            },
            {
              "Key": "RU-SMO",
              "Name": "Смоленская область"
            },
            {
              "Key": "RU-TAM",
              "Name": "Тамбовская область"
            },
            {
              "Key": "RU-TVE",
              "Name": "Тверская область"
            },
            {
              "Key": "RU-TOM",
              "Name": "Томская область",
              "Desc": [
                "<h4>Богоявленский собор<span>1630</span></h4><p><img src='img/800px-Bogoyavlensky_cathedral_in_Tomsk.JPG'>Богоявленский собор является одним из древнейших томских храмов. Он берёт своё начало от деревянной церкви, построенной в 1630 году. Позже на месте алтаря старой деревянной церкви в 1858 году построили часовню Иверской иконы Божией Матери. Существующее каменное двухэтажное здание собора в стиле барокко было заложено в 1777 году. Нижний этаж каменной церкви был освящён в 1784 году в честь Богоявления Господня. Вскоре на нижнем этаже был освящён придел Архангела Михаила, а на верхнем — Ильинский и Спасский приделы. Храм имеет особое значение для томской истории. Именно Богоявленскую церковь выбрал первый томский губернатор В. С. Хвостов, в которой на праздник Преображения Господня 6 августа 1804 году было объявлено открытие Томской губернии. С 1892 года при соборе существовало попечительство о бедных, с 1898 года — церковно-приходская школа. При храме работала библиотека, насчитывавшая 400 томов книг. Поскольку храм был посвящён Богоявлению или Крещению Господня, то ежегодно 19 января (по старому стилю 6 января) на Крещение из храма устраивался крестной ход на реку Томь для совершения обряда Великого водоосвящения. Крестный ход устраивался также в день Пятидесятницы и в праздник Первому Спасу.</p>",
                "<h4>Знаменская церковь<span>1803</span></h4><p><img src='img/sfvergregbrdbrdger.jpg'>Знаменская церковь берёт своё начало от деревянной церкви, построенной в 1703 году в честь иконы Божией матери «Знамение» (Абалакская) дворянином Иваном Качаловым, который происходил из города Углича. К концу века церковь была достаточно ветхой, и после пожара решено было построить каменный храм. Строительство велось на средства потомков Качалова. Закладка нового храма произошла в 1789 году. Архитектурный стиль здания — сибирское барокко. Северный придел (во имя святой великомученицы Екатерины — небесной покровительницы императрицы Екатерины II, подписавшей прошение о строительстве каменной Знаменской церкви) был освящён 15 октября 1803 года, Главный престол (в честь Абалакской иконы Божией Матери «Знамение») — 9 ноября 1810 года.</p>"
              ]
            },
            {
              "Key": "RU-TUL",
              "Name": "Тульская область"
            },
            {
              "Key": "RU-TYU",
              "Name": "Тюменская область"
            },
            {
              "Key": "RU-ULY",
              "Name": "Ульяновская область"
            },
            {
              "Key": "RU-CHE",
              "Name": "Челябинская область"
            },
            {
              "Key": "RU-YAR",
              "Name": "Ярославская область"
            },
            {
              "Key": "RU-AD",
              "Name": "Адыгея"
            },
            {
              "Key": "RU-BA",
              "Name": "Башкортостан"
            },
            {
              "Key": "RU-BU",
              "Name": "Бурятия"
            },
            {
              "Key": "RU-DA",
              "Name": "Дагестан"
            },
            {
              "Key": "RU-IN",
              "Name": "Ингушетия"
            },
            {
              "Key": "RU-KB",
              "Name": "Кабардино-Балкария"
            },
            {
              "Key": "RU-KL",
              "Name": "Калмыкия"
            },
            {
              "Key": "RU-KC",
              "Name": "Карачаево-Черкесия"
            },
            {
              "Key": "RU-KR",
              "Name": "Карелия"
            },
            {
              "Key": "RU-ME",
              "Name": "Марий Эл"
            },
            {
              "Key": "RU-MO",
              "Name": "Мордовия"
            },
            {
              "Key": "RU-AL",
              "Name": "Республика Алтай"
            },
            {
              "Key": "RU-KO",
              "Name": "Республика Коми"
            },
            {
              "Key": "RU-SA",
              "Name": "Республика Саха",
              "Desc": [
                "<h4>Свято-Троицкий храм<span>1996</span></h4><p><img src='img/iuy6t5rer.jpg'>В самом центре города Мирного, на Ленинградском проспекте, расположен Свято-Троицкий храм. Это, непревзойденной красоты архитектурное строение, радует глаз как местных жителей, так гостей города, которые приезжают «познакомится» с алмазной столицей.В 1996 году совершена закладка камня, на месте будущей святыни. Строительство храма велось за счет спонсорской помощи АК «АЛРОСА». Свято-Троицкий храм выполнен в стиле в традиционной русской православной архитектуры.</p>",
                "<h4>Атамайский Никольский храм<span>1870</span></h4><p><img src='img/serehryngfbvfdgtfytjgh.jpg'>Атамайская Николаевская церковь была построена в 1870 г. на средства инородца Атамайского наслега Намского улуса Никифора Аргунова и освящена 7 ноября того же года Преосвященнейшим Дионисием, епископом Якутским и Вилюйским. Могила Никифора Аргунова находится здесь же, на церковном кладбище, а церковь может служить ему достойным памятником. В 1895 г. после пожара силами прихожан была отстроена новая церковь с колокольней, 19 ноября того же года она была освящена епископом Мелетием во имя святителя Николая – именно это здание сегодня мы можем видеть почти в первозданном состоянии. 1 января 1898 г. при церкви была открыта одноклассная церковно-приходская школа, из стен которой вышло много замечательных людей Атамайского наслега. В Атамайском приходе до революции проживали 2 482 прихожанина 1-го Атамайского, Хатын-Аринского, Хамагаттинского, Тастахского и Мукучинского наслегов Намского улуса.</p>",
                "<h4>Храм преподобного Серафима Саровского <span>2010</span></h4><p><img src='img/jhgvbnm,kjnhbvg.jpg'>Храм преподобного Серафима Саровского строили в течение двух лет. Первая свая была забита 23 мая 2010 года. Проект осуществляла Якутская епархия, а церковные художники из Москвы и Санкт-Петербурга занимались росписью и оформлением храма. 7 октября 2012 года Митрополит Хабаровский и Приамурский Игнатий, епископ Якутский и Ленский Роман провели торжественное богослужение по случаю открытия храма в честь Преподобного Серафима Саровского. Митрополит Хабаровский и Приамурский Игнатий отметил, что храм Преподобного Серафима Саровского в Удачном напоминает собор Спаса на Крови в Санкт-Петербурге — символ торжества православия. Он сказал, что необходимо хранить свою веру и страну независимо от национальности и вероисповедания. Владыка также подчеркнул, что Святейший Патриарх Московский и Всея Руси Кирилл придает огромное значение развитию Дальнего Востока и севера нашего Отечества. </br>Адрес: Республика Саха (Якутия), Мирнинский р-он, г. Удачный.</p>"
              ]
            },
            {
              "Key": "RU-SE",
              "Name": "Северная Осетия"
            },
            {
              "Key": "RU-TA",
              "Name": "Татарстан"
            },
            {
              "Key": "RU-TY",
              "Name": "Тыва"
            },
            {
              "Key": "RU-UD",
              "Name": "Удмуртия"
            },
            {
              "Key": "RU-KK",
              "Name": "Хакасия"
            },
            {
              "Key": "RU-CE",
              "Name": "Чечня"
            },
            {
              "Key": "RU-CU",
              "Name": "Чувашия"
            },
            {
              "Key": "RU-ALT",
              "Name": "Алтайский край"
            },
            {
              "Key": "RU-ZAB",
              "Name": "Забайкальский край"
            },
            {
              "Key": "RU-KAM",
              "Name": "Камчатский край"
            },
            {
              "Key": "RU-KDA",
              "Name": "Краснодарский край"
            },
            {
              "Key": "RU-KYA",
              "Name": "Красноярский край",
              "Desc": [
                "<h4>Благовещенская церковь <span>1804</span></h4><p><img src='img/Church_of_the_Annunciation,_Krasnoyarsk.jpg'>Деревянную Покровскую церковь перенесли примерно на место нынешнего каменного храма.Был получен Указ архиепископа Варлаама из Тобольска о строительстве церкви, и в 1802 году началась заготовка бутового камня, кирпича, леса, железа, извести, копание рва под фундамент; а 3 ноября 1804 года была совершена закладка церкви. В расходной книге 1801 — 1808 годов упоминаются енисейские мастера Григорий Бусыгин и Поспелов, получившие 30 рублей за «Здеание планов». Контролировал постройку и вел расчеты с подрядчиками красноярский купец Егор Пороховщиков.</p>",
                "<h4>Воскресенский собор<span>1773</span></h4><p><img src='img/300px-Voscr.jpg'>Построен на территории острога — на Стрелке. В 1759 году староста красноярской соборной Преображения Господня церкви Леонтий Сидорович Пороховщиков нанял для постройки нового храма «города Енисейска разночинца» Петра Сокольникова. Вероятно, в качестве образца при строительстве первого каменного храма Красноярска был использован Спасский собор Спасского монастыря в Енисейске. В ходе строительства П. Сокольников был отстранён от руководства артелью, «по неисправной работе», и на его место в 1769 году был «подряжен» другой енисейский мастер — Савва Паклин, который к 1773 году и достроил здание церкви. Пожар 1773 года уничтожил Красноярский острог и практически весь город, после пожара осталось только 30 домов. Из церквей, уцелели Благовещенская церковь и Воскресенский собор. Сгорела и первая красноярская соборная Преображенская церковь.</p>",
              ]
            },
            {
              "Key": "RU-PER",
              "Name": "Пермский край"
            },
            {
              "Key": "RU-PRI",
              "Name": "Приморский край"
            },
            {
              "Key": "RU-STA",
              "Name": "Ставропольский край"
            },
            {
              "Key": "RU-KHA",
              "Name": "Хабаровский край"
            },
            {
              "Key": "RU-NEN",
              "Name": "Ненецкий автономный округ"
            },
            {
              "Key": "RU-KHM",
              "Name": "Ханты-Мансийский автономный округ",
              "Desc": [
                "<h4>Храм Воскресения Христова<span>1999</span></h4><p><img src='img/Church_of_the_resurrection_of_Christ_in_Khany-Mansiysk.JPG'>В храмовый комплекс входит соборный храм Воскресения Христова, увенчанный золотыми куполами с крестами. С северной стороны кафедрального собора находится «Православный парк». В летнее время в парке работают фонтаны. В середине аллеи стоит распятие и памятник святым равноапостольным Кириллу и Мефодию — просветителям славян. За храмом находится воскресная школа и православная гимназия. Справа от гимназии — храм в честь святого великого князя Владимира.</p>",
                "<h4>Храм Преображения Господня<span>2002</span></h4><p><img src='img/sdvreververv.jpg'>Храм Преображения Господня – главный храм города Сургута и один из красивейших храмов Ханты-Мансийского округа. Для строительства Храма было отведено живописное место возле реки. Рядом со святой обителью посадили кедры, специально привезённые с Алтая. Первая свая была забита в мае 1992 года. Деньги на строительство сургутяне собирали всем миром: помогали нефтяники, коммерсанты, часть средств была перечислена из городской казны. Подрядчиком выступил трест «Сургутгазстрой». Строительство храма закончилось в 2002 году. В воскресенье, 29 декабря 2002 года, состоялась торжественная церемония передачи нового храма Преображения Господня православной общине.</p>"
              ]
            },
            {
              "Key": "RU-CHU",
              "Name": "Чукотский автономный округ"
            },
            {
              "Key": "RU-YAN",
              "Name": "Ямало-Ненецкий автономный округ",
              "Desc": [
                "<h4>Храм Святых Апостолов Петра и Павла<span>1470</span></h4><p><img src='img/frververdvregvrv.JPG'>Церковь Петра и Павла в Салехарде - первый каменный православный храм, который был построен на вечной мерзлоте.Сведений о первой церкви в Обдорске в архивных документах пока не найдено, и мы не можем точно сказать, во имя кого была она заложена. Приходившая в ветхость церковь реконструировалась, каждый раз меняя свое название. И вот в архивном документе за 1747 год «Дело об освящении в Обдорском остроге новой церкви святого Василия Великого» мы читаем, что в 1746 году обветшавшее здание снесли, а на его месте заложили новую церковь из кедрового леса во имя святого Василия Великого с приделом Святителя Николая Чудотворца. По истечении срока износа церковь вновь была снесена и заложена по благословению Архиепископа Амвросия в 1817 году трехпрестольная: во имя апостолов Петра и Павла с приделами святого Василия Великого и святого Николая Чудотворца. В сентябре 1894 года храм во имя апостолов Петра и Павла был освящен Агафангелом, епископом Тобольским и Сибирским. Каменный храм во имя святых апостолов Петра и Павла был действующим до лета 1930 года.</p>",
                "<h4>Храм в честь святителя Николая архиепископа Мир Ликийского<span>1992</span></h4><p><img src='img/ewfreverfvrever.jpg'>В марте 1992 года, в дни празднования 20-летия города, на месте будущего храма — центральной площади Надыма — был воздвигнут крест и заложен камень. Тогда же состоялся крестный ход, возглавил который митрополит Тюменский и Тобольский Димитрий. В июле 1994 года Надым впервые посетил Святейший Патриарх Московский и всея Руси Алексий II, освятивший первый камень в основании храма. В марте 1992 года, в дни празднования 20-летия города, на месте будущего храма — центральной площади Надыма — был воздвигнут крест и заложен камень. Тогда же состоялся крестный ход, возглавил который митрополит Тюменский и Тобольский Димитрий. В июле 1994 года Надым впервые посетил Святейший Патриарх Московский и всея Руси Алексий II, освятивший первый камень в основании храма. Заботу о строительстве храма приняла на себя не только православная община города. Главным заказчиком и разработчиком всей проектно-сметной документации выступила администрация Надыма. Стройматериалы, оборудование, технику, а также квалифицированных рабочих предоставило предприятие «Надымгазпром». Не остались в стороне и коммерческие структуры. Для рядовых горожан, а также всех желающих внести посильную лепту в строительство храма был открыт специальный счет, первая сумма на него была перечислена мэром.</p>"
              ]
              // ,
              // "Desc": [
              //   "<h4><span></span></h4><p><img src='img/'></p>",
              //   "<h4><span></span></h4><p><img src='img/'></p>"
              // ]
            }];

function Home() {
  document.getElementById('loader').classList.add('on');
  setTimeout(function () {
    document.getElementById('loader').classList.add('go');
  }, 100);

  $('#app').empty();
  $('#app').append('<div class="container"><div><h2 class="mt-5">Задачи проекта</h2><p>Cобрать и сделать общедоступной максимально полную коллекцию современных и архивных фотографий и, по возможности, наиболее полные описания всех православных храмов, монастырей и других православных сооружений России и мира. Современных и исторических, действующих и заброшенных, разрушающихся и восстанавливаемых, существующих или сохранившихся лишь на фотографиях.</p><p>Все объекты, статьи и фотографии, которые есть в каталоге, добавлены людьми, разделяющими наш интерес к православной культуре, истории и архитектуре, страсть к путешествиям и любовь к фотографии. Современные фотографии сделаны соавторами непосредственно во время своих походов или поездок.</p></div><div><h2 class="mt-5">География</h2><p>При составлении географического каталога за основу взято административно-территориальное деление Российской Федерации по состоянию на 1 января 2002 года. Для упрощения поиска многие города областного подчинения, закрытые административно-территориальные образования и проч. отнесены к административным районам, центрами которых они являются или территории которых их окружают.</p><table class="table table-hover table-borderless">  <thead>    <tr>      <th>Местность</th>      <th scope="col">Обьектов</th>    </tr>  </thead>  <tbody>    <tr><th>Алтайский край</th><td>127</td></tr>    <tr><th>Амурская область</th><td>8</td></tr>    <tr><th>Архангельская область</th><td>884</td></tr><tr><th>Архангельская область</th><td>884</td></tr><tr><th>Белгородская область</th><td>229</td></tr><tr><th>Брянская область</th><td>396</td></tr><tr><th>Владимирская область</th><td>1023</td></tr><tr><th>Волгоградская область</th><td>105</td></tr><tr><th>Вологодская область</th><td>853</td></tr><tr><th>Воронежская область</th><td>229</td></tr><tr><th>Забайкальский край</th><td>20</td></tr><tr><th>Ивановская область</th><td>619</td></tr><tr><th>Иркутская область</th><td>79</td></tr><tr><th>Калининградская область</th><td>46</td></tr><tr><th>Калужская область</th><td>920</td></tr><tr><th>Камчатский край</th><td>4</td></tr><tr><th>Карачаево-Черкесская Республика</th><td>9</td></tr><tr><th>Кемеровская область</th><td>159</td></tr><tr><th>Кировская область</th><td>357</td></tr><tr><th>Костромская область</th><td>905</td></tr><tr><th>Краснодарский край</th><td>455</td></tr><tr><th>Красноярский край</th><td>217</td></tr><tr><th>Курганская область</th><td>218</td></tr><tr><th>Курская область</th><td>97</td></tr><tr><th>Ленинградская область</th><td>576</td></tr><tr><th>Липецкая область</th><td>226</td></tr><tr><th>Магаданская область</th><td>10</td><tr><th>Москва</th><td>1535</td></tr><tr><th>Московская область</th><td>3835</td></tr><tr><th>Мурманская область</th><td>109</td></tr><tr><th>Нижегородская область</th><td>711</td></tr><tr><th>Новгородская область</th><td>395</td></tr><tr><th>Новосибирская область</th><td>214</td></tr><tr><th>Омская область</th><td>112</td></tr><tr><th>Оренбургская область</th><td>143</td></tr><tr><th>Орловская область</th><td>387</td></tr><tr><th>Пензенская область</th><td>210</td></tr><tr><th>Пермский край</th><td>526</td></tr><tr><th>Приморский край</th><td>39</td></tr><tr><th>Псковская область</th><td>468</td></tr><tr><th>Республика Адыгея</th><td>18</td></tr><tr><th>Республика Алтай</th><td>50</td></tr><tr><th>Республика Башкортостан</th><td>134</td></tr><tr><th>Республика Бурятия</th><td>52</td></tr><tr><th>Республика Дагестан</th><td>2</td></tr><tr><th>Республика Ингушетия</th><td>4</td></tr><tr><th>Республика Калмыкия</th><td>8</td></tr><tr><th>Республика Карелия</th><td>333</td></tr><tr><th>Республика Коми</th><td>174</td></tr><tr><th>Республика Крым</th><td>141</td></tr><tr><th>Республика Марий Эл</th><td>131</td></tr><tr><th>Республика Мордовия</th><td>338</td></tr><tr><th>Республика Саха (Якутия)</th><td>18</td></tr><tr><th>Республика Северная Осетия - Алания</th><td>24</td></tr><tr><th>Республика Татарстан</th><td>481</td></tr><tr><th>Республика Тува</th><td>4</td></tr><tr><th>Республика Хакасия</th><td>26</td></tr><tr><th>Ростовская область</th><td>98</td></tr><tr><th>Рязанская область</th><td>634</td></tr><tr><th>Самарская область</th><td>604</td></tr><tr><th>Санкт-Петербург</th><td>433</td></tr><tr><th>Саратовская область</th><td>88</td></tr><tr><th>Сахалинская область</th><td>8</td></tr><tr><th>Свердловская область</th><td>528</td><tr><th>Севастополь</th><td>62</td></tr><tr><th>Смоленская область</th><td>447</td></tr><tr><th>Ставропольский край</th><td>97</td></tr><tr><th>Тамбовская область</th><td>288</td></tr><tr><th>Тверская область</th><td>1266</td></tr><tr><th>Томская область</th><td>84</td></tr><tr><th>Тульская область</th><td>585</td></tr><tr><th>Тюменская область</th><td>170</td></tr><tr><th>Удмуртская Республика</th><td>157</td></tr><tr><th>Ульяновская область</th><td>147</td></tr><tr><th>Хабаровский край</th><td>11</td></tr><tr><th>Челябинская область</th><td>301</td></tr><tr><th>Чеченская Республика</th><td>1</td></tr><tr><th>Чувашская Республика</th><td>94</td></tr><tr><th>Чукотский автономный округ</th><td>1</td></tr><tr><th>Ярославская область</th><td>1221</td><tr><th><b>ВСЕГО:</b></th><td>26764</td>  </tbody></table></div></div>');

  setTimeout(function () {
    document.getElementById('loader').classList.remove('go');
    setTimeout(function () {
      document.getElementById('loader').classList.remove('on');
    }, 100);
  }, 300);
}

Home();

$("path.cls-1").click(function(e) {

  document.getElementById('loader').classList.add('on');
  setTimeout(function () {
    document.getElementById('loader').classList.add('go');
  }, 100);

  $("#app").empty();

  var frame = document.createElement('div');
  frame.id = 'page';
  frame.classList.add('container');

  document.getElementById(e.target.id).classList.add('map-select');

  $("#app").append(frame);

  var num = '';
  for (var i = 0; i < data.length; i++) {
    if (data[i].Key == e.target.id) {
      num = i;
      $("#page").append('<h2>' + data[num].Name + '</h2>');
      break;
    }
  }

  if (data[num].Desc) {
    for (var i = 0; i < data[num].Desc.length; i++) {
      $("#page").append('<div class="block">' + data[num].Desc[i] + '</div>');
    }
  } else{
   $("#page").append('<h4 class="my-4">Информация еще не добавлена</h4><p>Обратитесь в нашу поддержку для совместрого сотруднечества</p>');
  }

  $("#page").append('<h5 class="text-center">А так же другие...</h5>');

  setTimeout(function () {
    document.getElementById('loader').classList.remove('go');
    setTimeout(function () {
      document.getElementById('loader').classList.remove('on');
    }, 100);
  }, 300);

  $('img').click(function(e) {
    $('#modal-img').attr('src', e.target.src);
    $('#myModal').modal('show');
  });

});

window.onload = function () {

  $('.nav-items').click( function (e) {
    var data = e.target.getAttribute("data-name");
    switch (data) {
      case '/':
        Home();
        break;
    }
  });

  var count = 0;
  for (var i = 0; i < data.length; i++) {
    if (data[i].Desc) {
      for (var j = 0; j < data[i].Desc.length; j++) {
        count++;
      }
    }
  }

  var countBar = document.querySelectorAll("[data-name='count']")[0];
  countBar.innerHTML = 'На нашем сайте уже <b>' + count + '</b> храмов!';

  document.getElementById('footer').classList.add('text-center', 'p-5');
  $("#footer").html('Erilov Nikita');

};
